#pragma once
#include <random>
#include <map>

struct FFortLootTierDataCheck
{
public:
    FName                                         TierGroup;                                         // 0x0000(0x0008)(100% c'est ça)
    int32                                         LootTier;                                          // 0x0008(0x0004)(100% c'est ça)
    uint8                                         Pad_1[0x4];                                        // 0x000C(0x0004)(jsp ça commence à me faire peur)
    ELootQuotaLevel                               QuotaLevel;                                        // 0x0010(0x0001)(inshallah)
    FGameplayTagContainer                         GameplayTags;                                      // 0x0018(0x0008)(inshallah)
    int32                                         WorldLevel;                                        // 0x0020(0x0004)(inshallah)

};

struct FFortLootPackageDataCheck
{
public:
    FName                                         LootPackageName;                                   // 0x0000(0x0008)(100% c'est ça)
    int32                                         LootPackageCategory;                               // 0x0008(0x0004)(100% c'est ça)
    uint8                                         Pad_1[0x4];                                        // 0x000C(0x0004)(jsp ça commence à me faire peur)
    FGameplayTagContainer                         GameplayTags;                                      // 0x0010(0x0001)(inshallah)
    int32                                         WorldLevel;                                        // 0x0018(0x0008)(inshallah)

};

namespace Loots
{
    static inline TArray<TSoftObjectPtr<UDataTable>> LootTierDataTables;
    static inline TArray<TSoftObjectPtr<UDataTable>> LootPackageDataTables;

    UDataTable* LoadDataTable(TSoftObjectPtr<UDataTable> DataTableToLoad)
    {
        UDataTable* DataTable = DataTableToLoad.Get();

        if (!DataTable && DataTableToLoad.ObjectID.AssetPathName.IsValid())
        {
            const std::string& AssetPathName = UKismetStringLibrary::Conv_NameToString(DataTableToLoad.ObjectID.AssetPathName).ToString(); // ToString doesn't work idk
            DataTable = StaticLoadObject<UDataTable>(std::wstring(AssetPathName.begin(), AssetPathName.end()).c_str());
        }

        return DataTable;

        // 7FF66F229810
        /*UDataTable* (*LoadDataTable)(TSoftObjectPtr<UDataTable> DataTableToLoad, char a2) = decltype(LoadDataTable)(0xBD9810 + uintptr_t(GetModuleHandle(0)));

        return LoadDataTable(DataTableToLoad, 1);

